// express 서버 실행
// 0. express
// 1. port 속성(번호) 세팅
// 2. 메서드별 실행 코드 작성 app.set()
// 3. 실행할 포트번호 app.listen()

const express = require('express');
const app = express();

/* ------------------------------------------------------------------------------- */
// port 속성 세팅
// process.env.PORT||3000 >> process.env.PORT가 없으면 3000
/* ------------------------------------------------------------------------------- */
app.set('port', process.env.PORT||3000);

/* ------------------------------------------------------------------------------- */
// app.메서드('request url', (request, response)=>{});
// 메서드 종류 : get, post, put, delete .. 
/* ------------------------------------------------------------------------------- */
app.get('/', (req, res)=>{
    res.send('hello express');
});

/* ------------------------------------------------------------------------------- */
// app.listen(포트번호) 또는 app.listen(포트번호, 콜백함수)
/* ------------------------------------------------------------------------------- */
// app.listen(3000, ()=>{
app.listen(app.get('port'),()=>{
    console.log('3000 익스프레스 서버 실행');
});